// ã§í 
#pragma once
#include "DxLib.h"

// É~ÉmÇÃïù
#define BLOCK_HEIGHT 4		// èc
#define BLOCK_WIDTH 4		// â°

// É~ÉmÇÃéÌóﬁ
#define BLOCK_TYPE 7
#define BLOCK_ROTATE_TYPE 4

// ÉXÉeÅ[ÉWÇÃïù
#define STAGE_HEIGHT 23
#define STAGE_WIDTH 18

// ï`âÊÇ∑ÇÈÉ~ÉmìØémÇÃïù
#define DRAW_BLOCK_WIDTH 20

namespace kMino
{
	constexpr int blocks[BLOCK_HEIGHT * BLOCK_TYPE][BLOCK_WIDTH * BLOCK_ROTATE_TYPE] = {
		// OÉ~Ém	ÅÀÇ±ÇÍà»ç~ÇÕâÒì]ÇµÇΩÉ~Ém
		{0,0,0,0,	0,0,0,0,	0,0,0,0,	0,0,0,0},
		{0,1,1,0,	0,1,1,0,	0,1,1,0,	0,1,1,0},
		{0,1,1,0,	0,1,1,0,	0,1,1,0,	0,1,1,0},
		{0,0,0,0,	0,0,0,0,	0,0,0,0,	0,0,0,0},
		// IÉ~Ém
		{0,0,0,0,	0,2,0,0,	0,0,0,0,	0,0,2,0},
		{0,0,0,0,	0,2,0,0,	2,2,2,2,	0,0,2,0},
		{2,2,2,2,	0,2,0,0,	0,0,0,0,	0,0,2,0},
		{0,0,0,0,	0,2,0,0,	0,0,0,0,	0,0,2,0},
		// SÉ~Ém
		{0,0,0,0,	3,0,0,0,	0,0,0,0,	0,3,0,0},
		{0,3,3,0,	3,3,0,0,	0,3,3,0,	0,3,3,0},
		{3,3,0,0,	0,3,0,0,	3,3,0,0,	0,0,3,0},
		{0,0,0,0,	0,0,0,0,	0,0,0,0,	0,0,0,0},
		// ZÉ~Ém
		{0,0,0,0,	0,0,0,0,	0,0,0,0,	0,0,0,0},
		{4,4,0,0,	0,4,0,0,	4,4,0,0,	0,0,4,0},
		{0,4,4,0,	4,4,0,0,	0,4,4,0,	0,4,4,0},
		{0,0,0,0,	4,0,0,0,	0,0,0,0,	0,4,0,0},
		// JÉ~Ém
		{0,0,0,0,	0,0,0,0,	0,0,0,0,	0,0,0,0},
		{5,0,0,0,	0,5,5,0,	0,0,0,0,	0,5,0,0},
		{5,5,5,0,	0,5,0,0,	5,5,5,0,	0,5,0,0},
		{0,0,0,0,	0,5,0,0,	0,0,5,0,	5,5,0,0},
		// LÉ~Ém
		{0,0,0,0,	0,0,0,0,	0,0,0,0,	0,0,0,0},
		{0,0,6,0,	0,6,0,0,	0,0,0,0,	6,6,0,0},
		{6,6,6,0,	0,6,0,0,	6,6,6,0,	0,6,0,0},
		{0,0,0,0,	0,6,6,0,	6,0,0,0,	0,6,0,0},
		// TÉ~Ém
		{0,0,0,0,	0,0,0,0,	0,0,0,0,	0,0,0,0},
		{0,7,0,0,	0,7,0,0,	0,0,0,0,	0,7,0,0},
		{7,7,7,0,	0,7,7,0,	7,7,7,0,	7,7,0,0},
		{0,0,0,0,	0,7,0,0,	0,7,0,0,	0,7,0,0},
	};
}

namespace kColor
{
	// É~Ém
	const int Color_Yellow = GetColor(255, 255, 0);		// â©O
	const int Color_LightBlue = GetColor(0, 0, 120);	// êÖI
	const int Color_Green = GetColor(0, 200, 0);		// óŒS
	const int Color_Red = GetColor(255, 0, 0);			// ê‘Z
	const int Color_Blue = GetColor(0, 0, 255);			// ê¬J
	const int Color_Orange = GetColor(255, 120, 0);		// ûÚL
	const int Color_Purple = GetColor(255, 0, 255);		// éáT

	// ÉXÉeÅ[ÉW
	const int Color_Black = GetColor(0, 0, 0);			// çï
}